package org.monan.ohain.data;

/**
 * @author Yuewen.Huang
 * @email Yuewen.Huang@geely.com
 * @date 2019/10/23
 */
public class StringData implements Data<String> {

    public static String ASCII_CHAR = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789" ;

    public static String ZH_CHAR = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊于惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟溥印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴郁胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍却璩桑桂濮牛寿通边扈燕冀浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游郏竺权逯盖益桓公仉督岳帅缑亢况郈有琴归海晋楚闫法汝鄢涂钦商牟佘佴伯赏墨哈谯篁年爱阳佟言福南火铁迟漆官冼真展繁檀祭密敬揭舜楼疏冒浑挚胶随高皋原种练弥仓眭蹇覃阿门恽来綦召仪风介巨木京狐郇虎枚抗达杞苌折麦庆过竹端鲜皇亓老是秘畅邝还宾闾辜纵侴万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫羊舌尉迟公羊澹台公冶宗正濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空兀官司寇南门呼延子车颛孙端木巫马公西漆雕车正壤驷公良拓跋夹谷宰父谷梁段干百里东郭微生梁丘左丘东门西门南宫第五公仪公乘太史仲长叔孙屈突尔朱东乡相里胡母司城张廖雍门毋丘贺兰綦毋屋庐独孤南郭北宫王孙";

    public static String[] EMOJI_CHAR = {"😀","🙈"} ;

    @Override
    public String generate(){
//        Random random = new Random() ;
        return "helloworld" ;
    }

}
